# ==============================================================================
# Интерактивный курс Алгоритмы и структуры данных на Python 2019/07/01
# Тема 3. Массивы
# Задание 3.
#
# Исполнитель: Евгений Бабарыкин
#
# В массиве случайных целых чисел поменять местами минимальный
# и максимальный элементы.
# ==============================================================================

from random import random

count = int(input('Введите размер массива: '))
a = [0] * count
for i in range(count):
    a[i] = int(random() * 100)
print(a)

min = 0
max = 0
for i in range(count):
    if a[i] < a[min]:
        min = i
    elif a[i] > a[max]:
        max = i
b = a[min]
a[min] = a[max]
a[max] = b

print(a)